---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFrom2dTo3dFam
source: html/3b356471-a29d-a1f4-d61d-4c3bf7c0d358.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFrom2dTo3dFam Property

Can't copy 2D element(s) into a 3D family.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantCopyFrom2dTo3dFam { get; }
```